// дерево для использования в antd для форумов, подфорумов и топиков на любом уровне
export const forums = [
  {
    id: 1, //строка
    key: "0-0",
    name: "Животные",
    children: [
      {
        id: 2,
        key: "0-0-0",
        name: "Домашние животные",
        children: [
          {
            id: 3,
            key: "0-0-0-0",
            name: "Собаки и кошки",
            text: "Подробная информация о собаках и кошках",
          },
          {
            id: 4,
            key: "0-0-0-1",
            name: "Птицы",
            children: [
              {
                id: 5,
                key: "0-0-0-1-0",
                name: "Грызуны",
                text: "Подробная информация о грызунках",
              },
            ],
          },
        ],
      },
      {
        id: 6,
        key: "0-0-1",
        name: "Птицы",
        children: [
          {
            id: 7,
            key: "0-0-1-0",
            name: "Грызуны",
            text: "Подробная информация о грызунках",
          },
        ],
      },
    ],
  },
  {
    id: 8,
    key: "0-1",
    name: "Рыбы",
    children: [
      {
        id: 9,
        key: "0-1-0",
        name: "Рыбы",
        text: "Подробная информация о рыбах",
      },
      {
        id: 10,
        key: "0-1-1",
        name: "Рептилии",
        text: "Подробная информация о рептилиях",
      },
    ],
  },
  {
    id: 11,
    key: "0-2",
    name: "Млекопитающие",
    children: [],
  },
];
